# Data Manipulation and Cleaning in R
This notebook is designed for teaching data manipulation and cleaning using R. We will cover the following topics:
- Basic mathematical functions in R
- Filtering, subsetting, and sorting data
- Importing data from files
- Handling and cleaning missing data

Let's get started!

### Basic Mathematical Functions

In [3]:
# Creating a vector of sample data
data <- c(23, 15, 42, 57, 19, 34, 21)

# Calculating basic statistics
sum_data <- sum(data)
mean_data <- mean(data)
median_data <- median(data)
sd_data <- sd(data)

# Displaying results
cat("Sum:", sum_data, "\nMean:", mean_data, "\nMedian:", median_data, "\nStandard Deviation:", sd_data)

Sum: 211
Mean: 30.14286
Median: 23
Standard Deviation: 15.08231

### Filtering and Subsetting Data

In [3]:
# Example: Filtering numbers greater than 30
filtered_data <- subset(data, data > 30)
filtered_data

[1] 42 57 34

### Sorting Data

In [4]:
# Sorting data in ascending order
sorted_data <- sort(data)

# Sorting in descending order
sorted_data_desc <- sort(data, decreasing = TRUE)

cat("Ascending Order:", sorted_data, "\nDescending Order:", sorted_data_desc)

Ascending Order: 15 19 21 23 34 42 57
Descending Order: 57 42 34 23 21 19 15

### Importing and Cleaning Data

In [6]:
# Importing data from a CSV file
data <- read.csv('diabetes.csv')

# Displaying the first few rows of the data
head(data)

  Pregnancies Glucose BloodPressure SkinThickness Insulin BMI
1  6          148     72            35             NA     33.6
2  1           85     66            29             NA     26.6
3  8          183     64            NA             NA     23.3
4  1           89     66            23             94     28.1
5 NA          137     40            35            168     43.1
6  5          116     74            NA             NA     25.6
  DiabetesPedigreeFunction Age Outcome
1 0.627                    50  1
2 0.351                    31  0
3 0.672                    32  1
4 0.167                    21  0
5 2.288                    33  1
6 0.201                    30  0

### Handling Missing Data

In [8]:
# Creating a sample data frame with missing values
data_with_na <- data.frame(
  name = c("Alice", "Bob", "Charlie", "David"),
  age = c(25, NA, 30, NA),
  score = c(85, 90, NA, 88)
)
data_with_na

  name    age score
1 Alice   25  85
2 Bob     NA  90
3 Charlie 30  NA
4 David   NA  88

In [9]:
# Removing rows with missing values
data_cleaned <- na.omit(data_with_na)
data_cleaned

  name  age score
1 Alice 25  85

### Replacing Missing Values

In [10]:
# Replacing NA values with the mean of the column
data_with_na$age[is.na(data_with_na$age)] <- mean(data_with_na$age, na.rm = TRUE)
data_with_na

  name    age  score
1 Alice   25.0 85
2 Bob     27.5 90
3 Charlie 30.0 NA
4 David   27.5 88